DesafioResolvvi/app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "predo"], ["state", "sj"], ["created_at", "2018-11-15 18:47:38.611398"], ["updated_at", "2018-11-15 18:47:38.611398"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "state" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["state", "ce"], ["updated_at", "2018-11-15 18:16:55.826817"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 6]]
---
  def destroy
    @client.destroy