DesafioResolvvi/app/controllers/clients_controller.rb

  def index
    @clients = Client.all
    @lawyers = Lawyer.all
---
SELECT "clients".* FROM "clients"
SELECT "lawyers".* FROM "lawyers"

  def show
	  @lawyers = Lawyer.all
    @states = State.all

    @NumLaw = 0                    # Contador de posições do vetor @AvailableLawyers
    @AvailableLawyers = []

    for i in 0..@lawyers.length-1
      if ((@client.state).upcase).split == (@lawyers[i].state).split    # Verificador Estado do cliente
                                                                        #  = Estado do advogado
          @AvailableLawyers[@NumLaw] = @lawyers[i]
          @NumLaw += 1
      end
    end

    if @AvailableLawyers.empty?    # Se estiver vazio, retorna 0 e exibe na tela:
                                   #"Desculpe, não possuímos nenhum advogado cadastrado no seu estado."
       @IdealLawyer = 0

    else

      for j in 0..@states.length-1
---
SELECT "lawyers".* FROM "lawyers"
SELECT "states".* FROM "states"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("name", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pedro"], ["state", "rj"], ["created_at", "2018-11-16 05:25:35.008883"], ["updated_at", "2018-11-16 05:25:35.008883"]]

  def update
    respond_to do |format|
      if @client.update(client_params)
---
UPDATE "clients" SET "state" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["state", "ce"], ["updated_at", "2018-11-15 18:16:55.826817"], ["id", 6]]

  def destroy
    @client.destroy
---
DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 10]]